# GetRenderingAsset Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AppearanceAssetElement..::..GetRenderingAsset Method
AppearanceAssetElement Class See Also
---
Gets the rendering asset for the appearance asset element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Asset GetRenderingAsset()
```

Visual Basic
---
```text
Public Function GetRenderingAsset As Asset
```

Visual C++
---
```text
public:
Asset^ GetRenderingAsset()
```

# ### Return Value
The rendering asset held by this appearance asset element.
# Remarks
The retrieved Asset may be empty if it is loaded from material library without any modification. In this case, you can use Application.GetAssets(AssetType.Appearance) to load all preset appearance assets, and retrieve the asset by its name.
# See Also
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace